Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/B13B.tmx
Source language: en_us
Languages: zh_cn

source: Tech Tip Tuesday: Pick A Browser That Fits
zh_cn: 周二技术提示:选择合适的浏览器

source: A big part of the simple life is learning to choose the right tool, the one that is most simple for the task at hand.
zh_cn: 简单生活的一个重要部分就在于学着选择合适的工具 对于手头任务最简单的那一个.

source: Sure, it may be possible to accomplish the task with an inferior, outdated tool, but you're making it harder and more complicated than it needs to be.
zh_cn: 当然 用一个过时 低级的工具也可以完成任务 但是你正使它变得比它需要的更复杂和困难.

source: And those little complications, the visual clutter, the little annoyances, they wear on us throughout the day and affect productivity and mood, more than most of us realize.
zh_cn: 而这些小复杂 混乱视觉 小烦恼他们每天带给我们的多余劳动率和心情 比比我们意识到的要多的多.

source: How much time do you spend online every day?
zh_cn: 每天你花在网上的时间是多少?

source: An hour or two, or five, or eight?
zh_cn: 1 2小时 或者5小时 8小时?

source: You may go to hundreds of different websites during that time, but there's one major tool that your using the entire time: your web browser.
zh_cn: 你可能在这个时间里会浏览上百个不同的网站 但有一样工具是你整个过程中必须的:你的网页浏览器.

source: Browsers are our window into another world, the online world.
zh_cn: 浏览器就是我们进入另一个世界 网上世界的窗户.

source: Have you ever considered what window you're looking through?
zh_cn: 你是否有考虑过你是通过哪扇窗户来看世界的?

source: If your window to the outside world is hazy, you're not going to be able to see out as well.
zh_cn: 如果你看外面世界的窗户是模糊地 你就不可能很好的看到外面的世界.

source: If the window glass you're looking through distorts things, you won't see them the way they were intended to be seen.
zh_cn: 如果你看世界的窗户的玻璃是扭曲的 你就不可能看到它们原本的样子.

source: If there is a bunch of knickknacks and doodads on the windowsill, it will distract you from what's outside!
zh_cn: 如果窗台上有一堆的小装束和小摆设 它会干扰你看外面的世界!
